<a href="https://colab.research.google.com/github/chirag3096/Data-Science-1/blob/main/Pandas_Introduction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
x=pd.read_csv('/content/Salaries.csv')

In [3]:
x

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [4]:
x.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [5]:
x.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [6]:
x.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [7]:
x.ndim

2

In [8]:
x.size

468

In [9]:
x.shape

(78, 6)

In [14]:
x['service'].dtypes

dtype('int64')

In [18]:
x.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [19]:
x.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [20]:
x.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [23]:
x.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [25]:
x.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [27]:
x.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [31]:
x.sample(15)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
58       Prof          B   36       26  Female  144651
25       Prof          B   35       31    Male   99418
43   AsstProf          B    5        0  Female   77000
6   AssocProf          A   20       17    Male   81285
20   AsstProf          B    4        4    Male   92000
64  AssocProf          A   26       24  Female   73300
29       Prof          B   21       20    Male  123683
36       Prof          B   45       45    Male  146856
63       Prof          A   29       27  Female   91000
1        Prof          A   12        6    Male   93000
38   AsstProf          B    4        3    Male   91000
44       Prof          B   23       19  Female  151768
18       Prof          A   19        7    Male  107300
45       Prof          B   25       25  Female  140096

In [33]:
x.dropna()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [34]:
x.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [35]:
x.phd.count()

78

In [36]:
x.phd.mean()

19.705128205128204

In [64]:
y=x.groupby(['rank']).mean()

In [65]:
y.mean()

phd           15.731591
service       11.643754
salary     98924.608197
dtype: float64

In [61]:
x.groupby('rank')[['service','salary']].mean()

             service         salary
rank
AssocProf  11.307692   91786.230769
AsstProf    2.210526   81362.789474
Prof       21.413043  123624.804348

In [84]:
x[x['salary']>120000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

In [78]:
x['sex']=='Female'

0     False
1     False
2     False
3     False
4     False
      ...
73     True
74     True
75     True
76     True
77     True
Name: sex, Length: 78, dtype: bool

In [77]:
x[x['sex']=='Female']

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [83]:
x[x['service']>=25]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
9   Prof          A   51       51    Male   57800
10  Prof          B   39       33    Male  128250
13  Prof          B   35       33    Male  162200
19  Prof          A   29       27    Male  150500
21  Prof          A   33       30    Male  103106
25  Prof          B   35       31    Male   99418
27  Prof          A   45       43    Male  155865
36  Prof          B   45       45    Male  146856
40  Prof          A   39       36  Female  137000
45  Prof          B   25       25  Female  140096
58  Prof          B   36       26  Female  144651
63  Prof          A   29       27  Female   91000

In [93]:
x[(x['salary']>120000)&(x['sex']!='Female')&(x['service']>=25)]

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
10  Prof          B   39       33  Male  128250
13  Prof          B   35       33  Male  162200
19  Prof          A   29       27  Male  150500
27  Prof          A   45       43  Male  155865
36  Prof          B   45       45  Male  146856

In [94]:
x.iloc[2]

rank            Prof
discipline         A
phd               23
service           20
sex             Male
salary        110515
Name: 2, dtype: object

In [95]:
x.iloc[1,3]

6

In [98]:
x.iloc[:,4]

0       Male
1       Male
2       Male
3       Male
4       Male
       ...
73    Female
74    Female
75    Female
76    Female
77    Female
Name: sex, Length: 78, dtype: object

In [100]:
x.iloc[1:3,]

   rank discipline  phd  service   sex  salary
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515

In [111]:
x.iloc[[1,15],[2,4]]

    phd   sex
1    12  Male
15   17  Male